---
kind: type
id: T:Autodesk.Revit.DB.FormArrayIterator
source: html/41b46034-62c3-0082-667c-537c9ac3c7ab.htm
---
# Autodesk.Revit.DB.FormArrayIterator

An iterator to a form array.

## Syntax (C#)
```csharp
public abstract class FormArrayIterator : APIObject,
	IEnumerator
```